/*
변수는 크게 전역변수와 지역변수로 나뉜다.

전역변수 = 全 域 變 數 = 모든 지역에 접근할 수 있는 별명(변수)
          全 = 모두 전
          域 = 지역 역
          變 = 변할 변
          數 = 셀   수

지역변수 = 地 域 變 數 = 지방 지역에 접근할 수 있는 별명(변수)
                        지방 내에 있는 모든 지역에서만 접근 가능
                        외부 지방으로는 접근 불가!
          地 = 땅   지
          域 = 지역 역
          變 = 변할 변
          數 = 셀   수

[] = 대괄호 ==> 특정 수, 글자들을 나열할고 정의를 내릴 때 사용
            ex ) [사과, 포도, 오렌지, 딸기]

{} = 중괄호 ==> 기능을 설정할 때 사용
            ex ) 중괄호는 작성을 하면 중괄호 안을 비우면 안됨

() = 소괄호 ==> 기능명칭 뒤에 특정 값을 호출할 때 사용

    function 인사하기("대표님한테만") {
    
    }

    대괄호랑 소괄호는 안에 값이 없어도 됨
    중괄호는 안에 값이 있어야함

<>  = 부등호  ==> 크고 작음을 나타낼 때 사용
*/
